"""Даны два списка чисел. Посчитайте, сколько чисел содержится одновременно как в первом списке, так и во втором."""

print(len(set("564564141")))
print(len(set("5645478474")))

print(len(set("564564141")) + len(set("5645478474")))
