"""1. Дан список чисел. Определите, сколько в нем встречается различных чисел.
    - Примечание. Эту задачу на Питоне можно решить в одну строчку."""


print("Num of different elements: ", len(set('454151785411598971')))
print(set('454151785411598971'))