"""1. Дана строка.
    a. выведите третий символ этой строки.
    b. выведите предпоследний символ этой строки.
    c. выведите первые пять символов этой строки.
    d. выведите всю строку, кроме последних двух символов.
    e. выведите все символы с четными индексами (считая, что индексация начинается с 0, поэтому символы выводятся начиная
    с первого).
    f. выведите все символы с нечетными индексами, то есть начиная со второго символа строки.
    g. выведите все символы в обратном порядке.
    h. выведите все символы строки через один в обратном порядке, начиная с последнего.
    i. выведите длину данной строки."""

s = "съешь еще этих французских булок"
print(s)
print(s[2])
print(s[-2])
print("выведите первые пять символов этой строки.")
for i in range(0, 5):
    print(s[i])
print(s[:-2])
print("выведите все символы с четными индексами ")
for i in range(0, len(s)):
    if i % 2 == 0:
        print(s[i])
print("выведите все символы с нечетными индексами ")
for i in range(1, len(s)):
    if i % 2 != 0:
        print(s[i])
print(s[::-1])

i = len(s)-1
print("выведите все символы строки через один в обратном порядке, начиная с последнего.")
while i > 0:
    print(s[i])
    i -= 1
print("Length ofg the string is:", len(s)-1)